import webbrowser


#    print("Чётных цифр:" ) #paaris
#    print("Нечётных цифр:" ) #paaritu
#    print()
##''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
#    print("*Переворачиваем* введённое число")
#    print()
#    b=0
#    while a > 0:
#        number = a % 10
#        a = a // 10
#        b = b * 10
#        b =+ number
#    print("*Перевёрнутое* число", b)
#    print()
##''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
#    print("Проверяем гипотезу Сиракуз")
#    print()
#    if c % 2 = 0:
#        print("с - чётное число. Делим на 2.")
#    else:
#        print("с - нечётное число. Умножаем на 3, прибавляем 1 и делим на 2.")
#    while c != 1:
#            if c % 2 = 0:
#                    c == c / 2
#            else:
#                    c == (3*c + 1) / 2
#            print("c, end= " )
#    print()
#    print("Гипотеза верна")